<!DOCTYPE html>
<html lang="pt-BR" >
<head>
	<title>Informa&ccedil;&otilde;es</title>
	<link href='https://fonts.googleapis.com/css?family=Droid+Serif|Open+Sans:400,700' rel='stylesheet' type='text/css'>
	<link rel="stylesheet" href="https://s3-us-west-2.amazonaws.com/s.cdpn.io/148866/reset.css"><link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/meyer-reset/2.0/reset.min.css">
	<link rel="stylesheet" href="../css/informacao.css">
</head>
<!-- partial:index.partial.html -->
<body>
	<button class="button" onclick="location.href='index.html'" style="position: absolute; right: 0;">Voltar</button>
	<header>	
		<h1>Informa&ccedil;&otilde;es Gerais</h1>
	</header>
	<br>
	<h2>Desenvolvimento</h2>
	<div class="boxed">
		<h3>Linguagem e principais bibliotecas</h3>
		<p>&bull; Ferramenta desenvolvida em linguagem <a href = "https://www.r-project.org/">R</a> vers&atilde;o 3.6.</p>
		<p>&bull; Interface desenvolvida com <a href = "https://shiny.rstudio.com/">Shiny</a>. Este &eacute; um pacote R que facilita a cria&ccedil;&atilde;o de aplica&ccedil;&otilde;es Web diretamente do R e utiliza CSS, widgets, html e a&ccedil;&otilde;es JavaScript para maior flexibilidade.</p>
		<p>&bull; Usa o pacote <a href = "https://cran.r-project.org/web/packages/clpAPI/index.html">clpAPI</a>: Interface R para a API em C do COIN-OR Clp.</p>		
		<p>&bull; A ferramenta cria uma estrutura de dados usando SQLite onde todos as informa&ccedil;&otilde;es s&atilde;o armazenadas. Mais informa&ccedil;&otilde;es em: <a href="index_db.html">sobre a base</a>.</p>
	</div>
	<br>
	<h2>Dados de entrada</h2>
	<div class="boxed">
		<h3>Caso NEWAVE</h3>
		<p>&bull; Possuir ou executar um caso que tenha gerado sa&iacute;das <font face = "Courier New">nwlistop</font> de gera&ccedil;&atilde;o hidro total e energia armazenada final em percentual da m&aacute;xima (<font face = "Courier New">ghtot e earmfp</font>), de acordo com o tipo de simula&ccedil;&atilde;o desejada - s&eacute;rie hist&oacute;rica ou sint&eacute;tica (<font face = "Courier New">shist/sssint</font>). Garantir o formato indicado pois os arquivos com sufixo "m" s&atilde;o de submercado e s&atilde;o necess&aacute;rios os de REEs.</p>
		<p>&bull; O balan&ccedil;o de ponta identifica automaticamente o tipo de simula&ccedil;&atilde;o atrav&eacute;s do arquivo de dados gerais (dger.xxx) do NEWAVE. Portanto, deve-se garantir que o campo "<font face = "Courier New">TIPO SIMUL. FINAL</font>" do arquivo deve estar preenchido corretamente (1: s&eacute;rie sint&eacute;tica; 2: s&eacute;rie hist&oacute;rica).</p>
		<p>&bull; A pasta onde se localiza o caso deve conter o arquivo relat&oacute;rio de sa&iacute;da da simula&ccedil;&atilde;o completa (<font face = "Courier New">relat, replaca ou pmo.dat</font>). Esses arquivos n&atilde;o podem ser da simulasimula&ccedil;&atilde;o final.</p>
		<p>&bull; O arquivo <font face = "Courier New">exph</font> n&atilde;o pode conter TABs. Caso contr&aacute;rio dever haver problemas de leitura.</p> 
		<p>&bull; A informa&ccedil;&atilde;o de Mercado deve conter todos os subsistemas (mesmo que com valor zerado)</p>
		<p>&bull; Arquivo <font face = "Courier New"><b>dadosOFR.xlsx</b></font>: Possui as contribui&ccedil;&otilde;es das renov&aacute;veis n&atilde;o despachadas para a ponta. O arquivo possui quatro abas: FatorPonta, RelacaoIndicativas, SazonalidadeIndicativas e TipoContribuicaoPonta. Este arquivo deve estar presente na mesma pasta dos arquivos do caso.</p>
		<p style="margin-left: 20px">&bull; <b>FatorPonta</b>: Nessa aba ficam os fatores de contribui&ccedil;&atilde;o mensal informados em fun&ccedil;&atilde;o da pot&ecirc;ncia instalada da fonte (tipo 1).</p>
		<p style="margin-left: 30px; padding-top:6px"><img src = "../imagens/cabecalho_fator_ponta.png" /></p>
		<p style="margin-left: 20px">&bull; <b>RelacaoIndicativas</b>: Nessa aba ficam os dados de "de para" referentes ao cabe&ccedil;alho do arquivo saidaExpansao.txt, oriundo do MDI. O campo TipoFonte deve seguir o formato do MDI.</p>
		<p style="margin-left: 30px; padding-top:6px"><img src = "../imagens/cabecalho_relacao_indicativas.png" /></p>
		<p style="margin-left: 20px">&bull; <b>SazonalidadeIndicativas</b>: Nessa aba ficam os dados de sazonalidade das fontes indicativas da expans&atilde;o.</p>
		<p style="margin-left: 30px; padding-top:6px"><img src = "../imagens/cabecalho_sazo_indicativas.png" /></p>
		<p style="margin-left: 20px">&bull; <b>TipoContribuicaoPonta</b>: Nessa aba ficam as indica&ccedil;ões do tipo de contribui&ccedil;&atilde;o de ponta. A disponibilidade de potência pode ser considerada como sendo o valor m&eacute;io mensal da sua gera&ccedil;&atilde;o (tipo 2), ou uma contribui&ccedil;&atilde;o mensal informada em fun&ccedil;&atilde;o da pot&ecirc;ncia instalada (tipo 1). Para os casos do tipo 1, a tabela <font face = "Courier New">BPO_A19_FATOR_PONTA_OFR</font> deve ser preenchida. Para tal, a informa&ccedil;&atilde;o deve ser inclu&iacute;da na aba <b>FatorPonta</b>. Para os casos do tipo 2, as informa&ccedil;&otilde;es ficam no arquivo excel GeraPeq. O campo <font face = "Courier New">A18_TX_DESCRICAO</font> deve seguir o mesmo formato do do campo TipoFonte, e consequentemetne, do MDI</p>
		<p style="margin-left: 30px; padding-top:6px"><img src = "../imagens/cabecalho_tipo_contribuicao_ponta.png" /></p>
		<p>&bull; Arquivo <font face = "Courier New"><b>GeraPeq</b></font>: Planilha excel contendo a gera&ccedil;&atilde;o sazonalizada das fontes n&atilde;o simuladas (pequenas). Os dados devem estar na aba de nome "Principal". Este arquivo deve estar presente na mesma pasta dos arquivos do caso.</p>
		<p style="margin-left: 30px; padding-top:6px"><img src = "../imagens/cabecalho_gerapeq.png" /></p>
		<p>&bull; Arquivo <font face = "Courier New"><b>saidaExpansao.txt</b></font>: Arquivo texto com a expans&atilde;o do MDI. Este arquivo deve estar presente na mesma pasta dos arquivos do caso.</p>
	</div>
</body>
</html>