<!DOCTYPE html>
<html lang="en" >
<head>
  <meta charset="UTF-8">
  <title>Como Utilizar a ferramenta?</title>

<link href='https://fonts.googleapis.com/css?family=Droid+Serif|Open+Sans:400,700' rel='stylesheet' type='text/css'>
<link rel="stylesheet" href="https://s3-us-west-2.amazonaws.com/s.cdpn.io/148866/reset.css"><link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/meyer-reset/2.0/reset.min.css">
<link rel="stylesheet" href="../css/informacao.css">
</head>
<!-- partial:index.partial.html -->
<body>
	<button class="button" onclick="location.href='index.html'" style="position: absolute; right: 0;">Voltar</button>
	<header>	
		<h1>Como Utilizar a ferramenta?</h1>
	</header>
	<br>
	<h2>Barra de navega&ccedil;&atilde;o</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/barra_navegacao.png" />
				</td>
				<td>
					Na barra de navega&ccedil;&atilde;o pode-se acessar a aba do c&aacute;lculo do balan&ccedil;o de ponta, a aba de gr&aacute;ficos, o link para ajuda e o bot&atilde;o de sair.
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Selecionar o tipo de caso</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/cb_tipo_caso.png" height = 70px />
				</td>
				<td>
					Nesta caixa de sele&ccedil;&atilde;o o usu&aacute;rio deve escolher o tipo de caso que vai ser usado para a execu&ccedil;&atilde;o do balan&ccedil;o de ponta.
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Selecionar o modelo</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/cb_modelo.png" height = 70px />
				</td>
				<td>
					Nesta caixa de sele&ccedil;&atilde;o o usu&aacute;rio deve escolher o modelo utilizado no caso se refer&ecirc;ncia.
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Selecionar o tipo de demanda</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/cb_demanda.png" height = 70px />
				</td>
				<td>
					Nesta caixa de sele&ccedil;&atilde;o o usu&aacute;rio deve escolher o tipo de demanda que ser&aacute; usada no c&aacute;lculo do balan&ccedil;o de ponta. As op&ccedil;&otilde;es s&atilde;o: Determin&iacute;stica ou L&iacute;quida. Com a demanda determin&iacute;stica ser&aacute; calculado o balan&ccedil;o com um valor de demanda por janela de tempo (m&ecirc;s). J&aacute; com a demanda l&iacute;quida, o balan&ccedil;o ser&aacute; calculado com uma distribui&ccedil;&atilde;o de valores de demanda formada pela demanda bruta menos as gera&ccedil;&otilde;es n&atilde;o control&aacute;veis.	
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Definir o n&uacute;mero do caso</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/tb_caso.png" height = 70px />
				</td>
				<td>
					Nesta caixa de texto o usu&aacute;rio deve definir o n&uacute;mero do caso em estudo.	
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Definir o n&uacute;mero de horas de ponta</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/tb_horas_ponta.png" height = 70px />
				</td>
				<td>
					Nesta caixa de texto o usu&aacute;rio deve definir o n&uacute;mero de horas de ponta para c&aacute;lculo do balan&ccedil;o de ponta. O valor padr&atilde;o usado pela EPE &eacute; de 10 horas.	
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Descri&ccedil;&atilde;o do caso</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/tb_descricao.png" />
				</td>
				<td>
					Nesta caixa de texto o usu&aacute;rio deve definir a descri&ccedil;&atilde;o do caso. Este campo &eacute; aberto para colocar as informa&ccedil;&otilde;es relevantes para descrever o caso.
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Definir as datas de in&iacute;cio e fim do estudo do MDI</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/tb_data_MDI.png" />
				</td>
				<td>
					Nestas caixas de texto o usu&aacute;rio deve definir as datas de in&iacute;cio e fim do estudo do MDI. O formato deve ser aaaamm. Por exemplo 201901 e 203312.
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Definir os reservat&oacute;rios equivalentes que n&atilde;o modulam e usar dados de m&eacute;dia</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/tbs_ree_nao_modulam_media.png" height = 70px />
				</td>
				<td>
					Nesta caixa de texto o usu&aacute;rio deve definir quais os c&oacute;digos dos REEs que ter&atilde;o como disponibilidade de pot&ecirc;ncia a geração hidr&aacute;ulica m&eacute;dia. Exemplo de preenchimento para REEs 6,7 e 9: 6, 7, 9
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Definir os reservat&oacute;rios equivalentes que n&atilde;o modulam e usar dados de ponta</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/tbs_ree_nao_modulam_ponta.png" height = 70px />
				</td>
				<td>
					Nesta caixa de texto o usu&aacute;rio deve definir quais os c&oacute;digos dos REEs que ter&atilde;o como disponibilidade de pot&ecirc;ncia a geração hidr&aacute;ulica da ponta. Exemplo de preenchimento para REEs 6,7 e 9: 6, 7, 9
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Definir base SQLite existente para gravar o balan&ccedil;o de ponta</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/btn_pesquisar_base.png" height = 70px />
				</td>
				<td>
					Ao pressionar o bot&atilde;o indicado, o usu&aacute;rio poder&aacute; selecionar a base SQLite onde ser&atilde;o gravadas as informa&ccedil;&otilde;es do balan&ccedil;o de ponta.
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Criar base SQLite para gravar o balan&ccedil;o de ponta</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/btn_criar_base.png" height = 70px />
				</td>
				<td>
					Ao pressionar o bot&atilde;o indicado, a janela mostrada abaixo ser&aacute; aberta para o usu&aacute;rio. Nela ser&aacute; solicitada a escolha do local e a do nome da base SQLite onde ser&atilde;o gravadas as informa&ccedil;&otilde;es do balan&ccedil;o de ponta.<br>
					<img src = "../imagens/janela_nova_base.png" height = 200px />
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Selecionar a localiza&ccedil;&atilde;o dos arquivos com dados do caso para o balan&ccedil;o de ponta</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/btn_pasta_caso.png" height = 65px />
				</td>
				<td>
					Ao pressionar o bot&atilde;o indicado, o usu&aacute;rio poder&aacute; selecionar a pasta onde est&atilde;o os arquivos do caso do NEWAVE ou do SUISHI que ser&atilde;o usados para o c&aacute;culo do balan&ccedil;o de ponta.
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Calcular o balan&ccedil;o de ponta</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/btn_calcula_balanco.png" height = 65px />
				</td>
				<td>
					Ao pressionar o bot&atilde;o indicado, o usu&aacute;rio irá executar o c&aacute;culo do balan&ccedil;o de ponta. Caso a caixa de sele&ccedil;&atilde;o esteja marcada, ser&atilde;o gravadas somente as informa&ccedil;&otilde;es por REE (<font face = "Courier New">BPO_A16_BALANCO e BPO_A20_BALANCO_SUBSISTEMA</font>). Se estiver desmarcada, as informa&ccedil;&otilde;es de despacho por gerador tamb&eacute;m ser&atildeo gravadas (<font face = "Courier New">BPO_A17_BALANCO_GERADOR</font>).
				</td>
			</tr>
		</table>
	</div>
	<br>
</body>
</html>