<!DOCTYPE html>
<html lang="pt-BR" >
<head>
	<title>Informa&ccedil;&otilde;es</title>
	<link href='https://fonts.googleapis.com/css?family=Droid+Serif|Open+Sans:400,700' rel='stylesheet' type='text/css'>
	<link rel="stylesheet" href="https://s3-us-west-2.amazonaws.com/s.cdpn.io/148866/reset.css"><link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/meyer-reset/2.0/reset.min.css">
	<link rel="stylesheet" href="../css/informacao.css">
</head>
<!-- partial:index.partial.html -->
<body>
	<button class="button" onclick="location.href='index.html'" style="position: absolute; right: 0;">Voltar</button>
	<header>	
		<h1>Informa&ccedil;&otilde;es Gerais</h1>
	</header>
	<br>
	<h2>Desenvolvimento</h2>
	<div class="boxed">
		<h3>Linguagem e principais bibliotecas</h3>
		<p></p>
		<p>&bull; A ferramenta de Balan&ccedil;o de Pot&ecirc;ncia foi desenvolvida em linguagem <a href = "https://www.r-project.org/">R</a> vers&atilde;o 4.</p>
		<p>&bull; A interface foi desenvolvida com <a href = "https://shiny.rstudio.com/">Shiny</a>. Este &eacute; um pacote R que facilita a cria&ccedil;&atilde;o de aplica&ccedil;&otilde;es Web diretamente do R e utiliza CSS, widgets, html e a&ccedil;&otilde;es JavaScript para maior flexibilidade.</p>
		<p>&bull; A ferramenta tamb&eacute;m usa o pacote <a href = "https://cran.r-project.org/web/packages/clpAPI/index.html">clpAPI</a>: Interface R para a API em C do COIN-OR Clp.</p>		
		<p>&bull; Os dados de entrada e de saída utilizados na ferramenta s&atilde;o estruturados em uma base de dados usando SQLite, onde todos as informa&ccedil;&otilde;es s&atilde;o armazenadas. Para mais informa&ccedil;&otilde;es sobre as tabelas de dados acesse o link: <a href="index_db.html">sobre a base</a>.</p>
	</div>
	<br>
	<h2>Dados de entrada</h2>
	<div class="boxed">
		<p>O Balan&ccedil;o de Pot&ecirc;ncia &eacute; executado principalmente a partir de alguns arquivos de entrada e de sa&iacute;da de uma simula&ccedil;&atilde;o completa do NEWAVE. Al&eacute;m desses dados, s&atilde;o necess&aacute;rios tamb&eacute;m alguns outros arquivos com informa&ccedil;&otilde;es complementares sobre caracter&iacute;sticas das fontes n&atilde;o despach&aacute;veis (dadosOFR.xlsx, GeraPeq.xlsx e expans&atilde;o.txt).</p>
		<h3>Para um caso NEWAVE</h3>
		<p></p>
		<p>&bull; Ap&oacute;s simula&ccedil;&atilde;o do caso NEWAVE que ser&aacute; objeto de an&aacute;lise, deve-se utilizar o software de impress&atilde;o de sa&iacute;das NWLISTOP para obter as seguintes sa&iacute;das por Reservat&oacute;rio Equivalente de Energia (REE): Gera&ccedil;&atilde;o hidr&aacute;ulica total (acr&ocirc;nimo <font face = "Courier New">ghtot</font>), energia armazenada final em percentual do armazenamento m&aacute;ximo (acr&ocirc;nimo <font face = "Courier New">earmfp</font>) e vertimento turbin&aacute;vel fio d&rsquo;&aacute;gua (acr&ocirc;nimo <font face = "Courier New">vertturb</font>), de acordo com o tipo de s&eacute;ries de entrada da simula&ccedil;&atilde;o realizada - s&eacute;ries hist&oacute;ricas ou sint&eacute;ticas. &Eacute; importante verificar o formato indicado para as sa&iacute;das e n&atilde;o confundir com os arquivos de sufixo &quot;m&quot;, que trazem dados por submercado e n&atilde;o por REE, conforme indicado.</p>
		
		<p>&bull; O balan&ccedil;o de ponta identifica automaticamente o tipo de simula&ccedil;&atilde;o atrav&eacute;s do arquivo de dados gerais (dger.xxx) do NEWAVE. Portanto, deve-se garantir que o campo "<font face = "Courier New">TIPO SIMUL. FINAL</font>" do arquivo deve estar preenchido corretamente (1: s&eacute;rie sint&eacute;tica; 2: s&eacute;rie hist&oacute;rica).</p>
		
		<p>&bull; A pasta onde se localiza o caso deve conter o arquivo relat&oacute;rio de sa&iacute;da da simula&ccedil;&atilde;o completa (<font face = "Courier New">relat</font> para o caso do PDE). Esse arquivo n&atilde;o pode ser o gerado apenas por rodada de simula&ccedil;&atilde;o final, mas sim de simula&ccedil;&atilde;o completa.</p>
		
		<p>&bull; &Eacute; importante verificar o espa&ccedil;amento e a tabula&ccedil;&atilde;o do arquivo <font face = "Courier New">exph</font>. Caso contr&aacute;rio, podem ocorrer problemas de leitura pela ferramenta.</p> 
		
		<p>&bull; A informa&ccedil;&atilde;o de carga, presente no arquivo <font face = "Courier New">sistema.xxx</font>, deve apresentar dados para todos os subsistemas (mesmo que com valor zerado)</p>
		
		<p>&bull; Arquivo <font face = "Courier New"><b>dadosOFR.xlsx</b></font>: Possui as contribui&ccedil;&otilde;es das renov&aacute;veis n&atilde;o despachadas para a ponta, o valor percentual das reservas de carga por subsistema e m&ecirc;s e o valor percentual da reserva por motivo da variabilidade das fontes renov&aacute;veis. O arquivo possui seis abas: FatorPonta, RelacaoIndicativas, SazonalidadeIndicativas, TipoContribuicaoPonta, ReservaRenovavel e Reserva. Este arquivo deve estar presente na mesma pasta dos arquivos do caso, indicada na interface da ferramenta.</p>
		
		<p style="margin-left: 20px">&bull; <b>FatorPonta</b>: Nessa aba ficam os fatores de contribui&ccedil;&atilde;o mensal para pot&ecirc;ncia informados em fun&ccedil;&atilde;o da pot&ecirc;ncia instalada da fonte. &Eacute; utilizado para fontes em que h&aacute; uma contribui&ccedil;&atilde;o espec&iacute;fica para pot&ecirc;ncia (fonte do tipo 1). Vale destacar que a coluna <font face = "Courier New">A18_CD_TIPO_FONTE</font> se refere ao c&oacute;digo do bloco de usinas n&atilde;o simuladas definida no arquivo <font face = "Courier New">patamar.*</font> e seu valor deve estar coerente com o definido no arquivo.</p>
		
		<p style="margin-left: 30px; padding-top:6px"><img src = "../imagens/cabecalho_fator_ponta.png" /></p>
		
		<p style="margin-left: 20px">&bull; <b>RelacaoIndicativas</b>: Nessa aba ficam os dados de agrupamento das fontes referentes ao cabe&ccedil;alho do arquivo saidaExpansao.txt (nome das fontes), oriundo do MDI. Os campos TipoFonte e NomeFonte devem seguir o formato do MDI. O campo TipoFonte corresponde ao campo <font face = "Courier New">A18_TX_DESCRICAO</font> da aba <b>TipoContribuicaoPonta</b> e eles devem se manter coerentes. O campo NomeFonte deve seguir o campo de mesmo nome na aba <b>SazonalidadeIndicativas</b>.</p>
		
		<p style="margin-left: 30px; padding-top:6px"><img src = "../imagens/cabecalho_relacao_indicativas.png" /></p>
		
		<p style="margin-left: 20px">&bull; <b>SazonalidadeIndicativas</b>: Nessa aba ficam os dados de sazonalidade m&eacute;dia mensal das fontes indicativas da expans&atilde;o.</p>
		
		<p style="margin-left: 30px; padding-top:6px"><img src = "../imagens/cabecalho_sazo_indicativas.png" /></p>
		
		<p style="margin-left: 20px">&bull; <b>TipoContribuicaoPonta</b>: Nessa aba ficam as indica&ccedil;ões do tipo de contribui&ccedil;&atilde;o de pot&ecirc;ncia das fontes. A disponibilidade de pot&ecirc;ncia pode ser informada a partir de uma sazonalidade m&eacute;ia mensal da sua gera&ccedil;&atilde;o (fontes do tipo 2), ou uma contribui&ccedil;&atilde;o mensal espec&iacute;fica informada em fun&ccedil;&atilde;o da pot&ecirc;ncia instalada (fontes do tipo 1). Para os casos do tipo 1, o fator de contribui&ccedil;&atilde;o de pot&ecirc;ncia em fun&ccedil;&atilde;o da capacidade instalada deve ser inclu&iacute;do na aba <b>FatorPonta</b>. As informa&ccedil;&otilde;es referentes &agrave; contribui&ccedil;&atilde;o sazonal m&eacute;dia mensal das usinas indicativas ficam na aba <b>SazonalidadeIndicativas</b>. O campo <font face = "Courier New">A18_TX_DESCRICAO</font>  corresponde ao campo TipoFonte da aba <b>RelacaoIndicativas</b> e deve se manter coerentes no mesmo formato do MDI.  O campo <font face = "Courier New">A18_CD_TIPO_FONTE</font> se refere ao c&oacute;digo do bloco de usinas n&atilde;o simuladas definida no arquivo <font face = "Courier New">patamar.*</font> e seu valor deve estar coerente com o definido no arquivo.</p>
		
		<p style="margin-left: 30px; padding-top:6px"><img src = "../imagens/cabecalho_tipo_contribuicao_ponta.png" /></p>
		
		<p style="margin-left: 20px">&bull; <b>ReservaRenovavel</b>: Nessa aba ficam os dados da reserva por motivo da variabilidade das fontes renov&aacute;veis. Este dado é o percentual da expectativa de gera&ccedil;&atilde;o da respectiva fonte por subsistema e m&ecirc;s. O campo <font face = "Courier New">A18_CD_TIPO_FONTE</font> se refere ao c&oacute;digo do bloco de usinas n&atilde;o simuladas definida no arquivo <font face = "Courier New">patamar.*</font> e seu valor deve estar coerente com o definido no arquivo.</p>
		
		<p style="margin-left: 30px; padding-top:6px"><img src = "../imagens/cabecalho_reserva_renovavel.png" /></p>
		
		<p style="margin-left: 20px">&bull; <b>Reserva</b>: Nessa aba ficam os dados da reserva em fun&ccedil;&atilde;o da carga. Os valores s&atilde;o percentuais relativos aos subsistemas e m&ecirc;s.</p>
		
		<p style="margin-left: 30px; padding-top:6px"><img src = "../imagens/cabecalho_reserva_carga.png" /></p>
		
		<p>&bull; Arquivo <font face = "Courier New"><b>GeraPeq.xlsx</b></font>: Planilha excel contendo a gera&ccedil;&atilde;o sazonalizada das fontes n&atilde;o simuladas (pequenas). Os dados devem estar na aba de nome "Principal". Este arquivo deve estar presente na mesma pasta dos arquivos do caso. O campo TIPO deste arquivo corresponde ao campo <font face = "Courier New">A18_TX_DESCRICAO</font> da aba <b>TipoContribuicaoPonta</b> e ao campo TipoFonte da aba <b>RelacaoIndicativas</b>, ambas da planilha <font face = "Courier New"><b>dadosOFR.xlsx</b></font>. O campo NOME corresponde ao campo NomeFonteMDI da aba <b>RelacaoIndicativas</b> da planilha <font face = "Courier New"><b>dadosOFR.xlsx</b></font>.</p>
		
		<p style="margin-left: 30px; padding-top:6px"><img src = "../imagens/cabecalho_gerapeq.png" /></p>
		
		<p>&bull; Arquivo <font face = "Courier New"><b>saidaExpansao.txt</b></font>: Arquivo texto com a expans&atilde;o indicativa do MDI. Este arquivo &eacute; um arquivo de sa&iacute;da do MDI. Este arquivo deve estar presente na mesma pasta dos arquivos do caso, pois ser&aacute; utilizado para a identifica&ccedil;&atilde;o do montante de expans&atilde;o de usinas n&atilde;o simuladas no NEWAVE.</p>
		
		<p>&bull; Arquivo <font face = "Courier New"><b>infoMDI.txt</b></font>: Arquivo texto com informa&ccedil;&otilde;es sobre o caso de expans&atilde;o executado pelo MDI. Este arquivo &eacute; um arquivo de sa&iacute;da do MDI. Este arquivo deve estar presente na mesma pasta dos arquivos do caso.</p>
	</div>
	<br>
	<h2>Resumo das rotinas de execu&ccedil;&atilde;o do Balan&ccedil;o de Pot&ecirc;ncia</h2>
	<div class="boxed">
		<p>Ap&oacute;s o preenchimento de todos os dados de entrada no painel &ldquo;Balan&ccedil;o de Pot&ecirc;ncia&rdquo; e a solicita&ccedil;&atilde;o de execu&ccedil;&atilde;o da aplica&ccedil;&atilde;o atrav&eacute;s do bot&atilde;o &ldquo;Calcula Balan&ccedil;o de Pot&ecirc;ncia&rdquo;, a ferramenta inicia sua execu&ccedil;&atilde;o com a leitura dos dados de entrada e sa&iacute;da do NEWAVE, das planilhas adicionais e do arquivo com as expans&otilde;es do MDI. Este processo executa as seguintes etapas:</p>
		<ol>
			<li>Efetua a leitura dos dados gerais e da configura&ccedil;&atilde;o hidr&aacute;ulica (pacote <font face = "Courier New">leitorrmpe</font>) a fim de definir a quantidade de cen&aacute;rios que ser&atilde;o utilizados na execu&ccedil;&atilde;o do BP. A defini&ccedil;&atilde;o segue o campo &quot;TIPO SIMUL. FINAL&quot; do arquivo <font face = "Courier New">dger.d*</font> de dados gerais (1: s&eacute;rie sint&eacute;tica; 2: s&eacute;rie hist&oacute;rica)</li>
			
			<li>Grava tabela <font face = "Courier New">BPO_A01_CASOS_ANALISE</font> com os dados de entrada definidos pelo usu&aacute;rio na interface</li>
			
			<li>Grava a tabela <font face = "Courier New">BPO_A02_SUBSISTEMAS</font> a partir do arquivo <font face = "Courier New">sistema.d*</font> (via pacote <font face = "Courier New">leitorrmpe</font>)</li>
			
			<li>Grava a tabela <font face = "Courier New">BPO_A02_REES</font> a partir da leitura do arquivo <font face = "Courier New">ree.d*</font> e de valores do tipo de c&aacute;lculo de pot&ecirc;ncia passados pelo usu&aacute;rio</li>
			
			<li>Grava dados das usinas hidr&aacute;ulicas originalmente nos arquivos <font face = "Courier New">confhd.*</font> e <font face = "Courier New">hidr.*</font> na tabela <font face = "Courier New">BPO_A03_DADOS_UHE</font> do banco de dados do balan&ccedil;o de pot&ecirc;ncia usando fun&ccedil;&otilde;es do pacote <font face = "Courier New">leitorrmpe</font></li>
			
			<li>Faz a grava&ccedil;&atilde;o dos dados referentes aos conjuntos e maquinas das usinas hidr&aacute;ulicas do NEWAVE no banco de dados do balan&ccedil;o de pot&ecirc;ncia. Os dados s&atilde;o gravados na tabela <font face = "Courier New">BPO_A04_MAQUINAS_UHE</font> usando fun&ccedil;&otilde;es do pacote <font face = "Courier New">leitorrmpe</font></li>
			
			<li>Faz a grava&ccedil;&atilde;o dos dados das usinas hidr&aacute;ulicas ao longo do horizonte de simula&ccedil;&atilde;o do NEWAVE na tabela <font face = "Courier New">BPO_A05_DADOS_VIGENTES_UHE</font> usando fun&ccedil;&otilde;es do pacote <font face = "Courier New">leitorrmpe</font></li></li>
			
			<li>Grava dados de armazenamento, vertimento turbin&aacute;vel e gera&ccedil;&atilde;o das usinas hidr&aacute;ulicas originalmente nos arquivos <font face = "Courier New">earmfpXXX.out</font>, <font face = "Courier New">verturbXXX.*</font> e <font face = "Courier New">ghtotXXX.out</font> na tabela <font face = "Courier New">BPO_A06_SAIDA_HIDRO_NEWAVE</font> usando fun&ccedil;&otilde;es do pacote <font face = "Courier New">leitorrmpe</font></li></li>
			
			<li>Faz a grava&ccedil;&atilde;o dos dados de demanda de ponta do NEWAVE, a partir dos arquivos <font face = "Courier New">sistema.d*</font> e <font face = "Courier New">patamar.d*</font>, na tabela <font face = "Courier New">BPO_A10_DEMANDA</font> usando fun&ccedil;&otilde;es do pacote <font face = "Courier New">leitorrmpe</font></li></li>
			
			<li>Faz a grava&ccedil;&atilde;o dos dados dos limites de intercambio ao longo do horizonte de simula&ccedil;&atilde;o do NEWAVE na tabela <font face = "Courier New">BPO_A11_INTERCAMBIOS</font> usando fun&ccedil;&otilde;es do pacote <font face = "Courier New">leitorrmpe</font></li></li>
			
			<li>Faz a grava&ccedil;&atilde;o dos dados de limite de agrupamento dos interc&acirc;mbios do NEWAVE na tabela <font face = "Courier New">BPO_A12_LIMITE_AGRUPAMENTOS_INTERCAMBIO</font> usando fun&ccedil;&otilde;es do pacote <font face = "Courier New">leitorrmpe</font></li></li>
			
			<li>Faz a grava&ccedil;&atilde;o dos dados de agrupamento dos interc&acirc;mbios do NEWAVE na tabela <font face = "Courier New">BPO_A15_AGRUPAMENTOS_INTERCAMBIO</font> usando fun&ccedil;&otilde;es do pacote <font face = "Courier New">leitorrmpe</font></li>
			
			<li>Faz a grava&ccedil;&atilde;o dos dados das usinas termel&eacute;tricas ao longo do horizonte de simula&ccedil;&atilde;o do NEWAVE na tabela <font face = "Courier New">BPO_A14_DISPONIBILIDADE_UTE</font> usando fun&ccedil;&otilde;es do pacote <font face = "Courier New">leitorrmpe</font></li>
			<li>Faz a grava&ccedil;&atilde;o dos dados de disponibilidade das outras fontes renov&aacute;veis do NEWAVE na tabela <font face = "Courier New">BPO_A13_DISPONIBILIDADE_OFR</font>. Al&eacute;m disso, grava as tabelas de apoio <font face = "Courier New">BPO_A18_TIPOS_OFR</font> e <font face = "Courier New">BPO_A19_FATOR_PONTA_OFR</font>.
			<ol>
				<li>Nessa parte, a planilha <font face = "Courier New">GeraPeq.xslx</font> &eacute; pesquisada na pasta de arquivos do NEWAVE indicada pelo usu&aacute;rio e a aba &ldquo;Principal&rdquo; &eacute; lida na busca somente das gera&ccedil;&otilde;es das usinas renov&aacute;veis n&atilde;o simuladas existentes.</li>
				
				<li>Tamb&eacute;m se busca a planilha <font face = "Courier New">dadosOFR.xlsx</font>, que deve possuir as abas &quot;FatorPonta&quot;, &quot;RelacaoIndicativas&quot;, &quot;SazonalidadeIndicativas&quot;, &quot;TipoContribuicaoPonta&quot;.</li>
				
				<li>Salva as informa&ccedil;&otilde;es da aba TipoContribuicaoPonta na tabela <font face = "Courier New">BPO_A18_TIPOS_OFR</font></li>
				
				<li>Salva as informa&ccedil;&otilde;es da aba FatorPonta na tabela <font face = "Courier New">BPO_A19_FATOR_PONTA_OFR</font></li>
				
				<li>Sendo um caso de PDE, processa informa&ccedil;&otilde;es das renov&aacute;veis indicativas, juntando as expans&otilde;es indicadas no arquivo <font face = "Courier New">saidaExpansao.txt</font> com a Sazonalidade das Indicativas da aba &ldquo;SazonalidadeIndicativas&rdquo; atrav&eacute;s da convers&atilde;o de c&oacute;digos definida na aba &ldquo;RelacaoIndicativas&rdquo;</li>
				
				<li>Finalmente, calcula a disponibilidade de ponta das usinas n&atilde;o simuladas, para cada per&iacute;odo do horizonte de simula&ccedil;&atilde;o, avaliando o tipo de contribui&ccedil;&atilde;o da ponta atribu&iacute;do. Se <font face = "Courier New">A18_TP_CONTRIBUICAO_PONTA</font> = 2 para a determinada fonte, a disponibilidade ser&aacute; igual a Energia x profundidade, caso contr&aacute;rio, a disponibilidade ser&aacute; igual a Pot&ecirc;ncia Instalada x Fator de contribui&ccedil;&atilde;o (definido na tabela <font face = "Courier New">BPO_A19_FATOR_PONTA_OFR</font>). A disponibilidade ser&aacute; gravada na tabela <font face = "Courier New">BPO_A13_DISPONIBILIDADE_OFR</font></li>
			</ol>
			</li>

			<li>Faz o c&aacute;lculo e a grava&ccedil;&atilde;o dos dados de reserva em fun&ccedil;&atilde;o da carga e em fun&ccedil;&atilde;o da pot&ecirc;ncia instalada de renov&aacute;veis na tabela <font face = "Courier New">BPO_A21_RESERVA</font></li>			
		</ol>
		<p>Passada a grava&ccedil;&atilde;o dos dados de entrada, se inicia o c&aacute;lculo da disponibilidade hidr&aacute;ulica e atualiza&ccedil;&atilde;o e grava&ccedil;&atilde;o das tabelas <font face = "Courier New">BPO_A06_SAIDA_HIDRO_NEWAVE</font>, <font face = "Courier New">BPO_A08_DADOS_CALCULADOS_UHE</font> e <font face = "Courier New">BPO_A09_DISPONIBILIDADE_HIDRO_PONTA_SUBSISTEMA</font></p>
		<ol>
			<li>Atualiza a informa&ccedil;&atilde;o de submotoriza&ccedil;&atilde;o da tabela <font face = "Courier New">BPO_A06_SAIDA_HIDRO_NEWAVE</font> com dados de submotoriza&ccedil;&atilde;o por REE (<font face = "Courier New">relat.d*</font>)</li>
			
			<li>Pega a informa&ccedil;&atilde;o das usinas do tipo 1 (que modulam) para c&aacute;lculo de disponibilidade</li>
			
			<li>Calcula o volume operativo por usina como: (volume m&aacute;ximo por usina &ndash; volume m&iacute;nimo por usina) * armazenamento percentual por REE + volume m&iacute;nimo por usina</li>
			
			<li>Atualiza a gera&ccedil;&atilde;o hidr&aacute;ulica por REE original da <font face = "Courier New">BPO_A06_SAIDA_HIDRO_NEWAVE</font> somando-se a submotoriza&ccedil;&atilde;o do respectivo REE</li>
			
			<li>Calcula a cota operativa a partir do volume operativo e do polin&ocirc;mio cota-volume</li>
			
			<li>Calcula a altura de queda l&iacute;quida como: <font face = "Courier New">cota operativa - canal de fuga m&eacute;dio - perdas</font></li>
			
			<li>Calcula a pot&ecirc;ncia m&aacute;xima por usina como: <font face = "Courier New">n&uacute;mero de m&aacute;quinas * pot&ecirc;ncia unit&aacute;ria * (1 - TEIF) * (1 - IP)</font>. Para os conjuntos onde a altura de queda l&iacute;quida &eacute; menor que a altura de refer&ecirc;ncia do conjunto, a pot&ecirc;ncia ser&aacute; um percentual da m&aacute;xima, calculado a partir da raz&atilde;o: <font face = "Courier New">(altura de queda l&iacute;quida/altura de refer&ecirc;ncia do conjunto)^coeficiente da turbina</font></li>
			
			<li>Calcula a gera&ccedil;&atilde;o hidr&aacute;ulica por usina, atrav&eacute;s do rateio da gera&ccedil;&atilde;o hidr&aacute;ulica de cada REE, de acordo com os valores de pot&ecirc;ncia m&aacute;xima dispon&iacute;vel de cada usina, sendo que a gera&ccedil;&atilde;o hidr&aacute;ulica de cada REE j&aacute; &eacute; abatida da gera&ccedil;&atilde;o hidr&aacute;ulica m&iacute;nima, priorizando assim o atendimento &agrave; essa restri&ccedil;&atilde;o: <font face = "Courier New">gera&ccedil;&atilde;o hidr&aacute;ulica por usina = gera&ccedil;&atilde;o hidr&aacute;ulica m&iacute;nima por usina + ((gera&ccedil;&atilde;o hidr&aacute;ulica por REE - gera&ccedil;&atilde;o hidr&aacute;ulica m&iacute;nima por REE) * ((pot&ecirc;ncia m&aacute;xima por usina - gera&ccedil;&atilde;o hidr&aacute;ulica m&iacute;nima por usina)/( pot&ecirc;ncia m&aacute;xima por REE - gera&ccedil;&atilde;o hidr&aacute;ulica m&iacute;nima por REE)))</font></li>
			
			<li>Realiza consist&ecirc;ncia do total de gera&ccedil;&atilde;o hidr&aacute;ulica m&iacute;nima. Se encontrar valor de gera&ccedil;&atilde;o hidr&aacute;ulica m&iacute;nima por REE maior que o gera&ccedil;&atilde;o hidr&aacute;ulica por REE, ajusta os dados de todas as usinas do respectivo REE: <font face = "Courier New">gera&ccedil;&atilde;o hidr&aacute;ulica m&iacute;nima por usina = gera&ccedil;&atilde;o hidr&aacute;ulica m&iacute;nima por usina * (1 - (gera&ccedil;&atilde;o hidr&aacute;ulica m&iacute;nima por REE - gera&ccedil;&atilde;o hidr&aacute;ulica por REE) / gera&ccedil;&atilde;o hidr&aacute;ulica m&iacute;nima por REE)</font></li>
			
			<li>Calcula a pot&ecirc;ncia modulada por: <font face = "Courier New">((gera&ccedil;&atilde;o hidr&aacute;ulica por usina * 730.5) - (gera&ccedil;&atilde;o hidr&aacute;ulica m&iacute;nima por usina * (730.5 &ndash; quantidade de horas de ponta))) / quantidade de horas de ponta</font></li>
			
			<li>Ajusta pot&ecirc;ncia m&aacute;xima de Tucurui definida na ferramenta (codigo da usina = 275, cota limite de 62 metros e pot&ecirc;ncia limite de 4000 MW)</li>
			
			<li>Grava tabela <font face = "Courier New">BPO_A08_DADOS_CALCULADOS_UHE</font></li>
			
			<li>Agrega disponibilidade de pot&ecirc;ncia das usinas por REE</li>
			
			<li>Calcula a disponibilidade hidr&aacute;ulica m&aacute;xima na ponta para os REEs que n&atilde;o modulam (usinas a fio d&rsquo;&aacute;gua com forte sazonalidade) como a expectativa m&eacute;dia de gera&ccedil;&atilde;o somada ao vertimento turbin&aacute;vel fio d&rsquo;&aacute;gua e submotoriza&ccedil;&atilde;o. Dados encontrados na tabela <font face = "Courier New">BPO_A06_SAIDA_HIDRO_NEWAVE</font></li>
			
			<li>Junta as disponibilidades hidr&aacute;ulicas dos REE que modulam com os que n&atilde;o modulam e grava a tabela <font face = "Courier New">BPO_A09_DISPONIBILIDADE_HIDRO_PONTA_SUBSISTEMA</font></li>			
		</ol>
		<p>Findado o c&aacute;lculo da disponibilidade h&iacute;drica, se inicia a organiza&ccedil;&atilde;o e c&aacute;lculo dos balan&ccedil;os de energia para cada s&eacute;rie hidr&aacute;ulica.</p>
		<ol>
			<li>Estrutura todos os dados de gera&ccedil;&atilde;o no formato: <font face = "Courier New">anoMes, tipoUsina, codUsina, subsistema, transmiss&atilde;o, inflexibilidade, disponibilidade e cvu</font>. Onde <font face = "Courier New">anoMes</font> &eacute; o ano e m&ecirc;s de ocorr&ecirc;ncia da gera&ccedil;&atilde;o; <font face = "Courier New">tipoUsina</font> &eacute; a defini&ccedil;&atilde;o de usina, como: "TERMICA", "HIDRO", "RENOVAVEIS", "DEFICIT" (o d&eacute;ficit &eacute; modelado como uma usina de tamanho grande e cvu = custo do d&eacute;fict); <font face = "Courier New">codUsina</font> conforme NEWAVE; <font face = "Courier New">subsistema</font> &eacute; subsistema da usina; <font face = "Courier New">transmiss&atilde;o</font> &eacute; um indicador se &eacute; um gerador real (valor 0), ou uma linha de transmiss&atilde;o com seu c&oacute;digo espec&iacute;fico; <font face = "Courier New">inflexibilidade</font> como a gera&ccedil;&atilde;o m&iacute;nima; <font face = "Courier New">disponibilidade</font> como a gera&ccedil;&atilde;o m&aacute;xima; e <font face = "Courier New">cvu</font> como o custo da gera&ccedil;&atilde;o</li>
			<li>Estrutura todos os dados das linhas de transmiss&atilde;o de forma similar ao de um gerador, contudo, o campo <font face = "Courier New">tipoUsina</font> passa a receber "TRANSMISSAO", o <font face = "Courier New">codUsina</font> recebe o subsistema de origem ou de destino (toda a linha &eacute; cadastrada duas vezes, uma como gerador na origem e outra no destino), o campo <font face = "Courier New">transmiss&atilde;o</font> recebe um c&oacute;digo que representa a linha, podendo ser <font face = "Courier New">SUBSISTEMA ORIGEM * 1000 + SUBSISTEMA DESTINO</font>, ou <font face = "Courier New">SUBSISTEMA ORIGEM * 1000 + SUBSISTEMA DESTINO * -1</font> para identificar seu gerador equivalente no subsistema de origem ou destino; o campo <font face = "Courier New">inflexibilidade</font> recebe o valor m&iacute;nimo de transmiss&atilde;o e a <font face = "Courier New">disponibilidade</font> o m&aacute;ximo da linha. Ao campo <font face = "Courier New">cvu</font> &eacute; atribu&iacute;do o valor de 2e-6 para que o modelo n&atilde;o use a transmiss&atilde;o desnecessariamente. Para evitar o problema de fluxo em dois sentidos na linha, ocorr&ecirc;ncia comum quando se modela a transmiss&atilde;o por tubos em programa&ccedil;&atilde;o linear, as linhas de transmiss&atilde;o foram modeladas como dois geradores fict&iacute;cios, um de valor positivo no subsistema de recebimento e um de valor negativo no subsistema de envio, com uma restri&ccedil;&atilde;o adicional da soma destes valores ser igual a zero;</li>
			<li>S&atilde;o organizados os agrupamentos de linhas e suas restri&ccedil;&otilde;es de acordo com os novos c&oacute;digos estabelecidos das linhas</li>
			<li>Estrutura os valores da demanda no horizonte de estudos, assim como a reserva. Estes se tornar&atilde;o uma restri&ccedil;&atilde;o de igualdade no problema linear (PL)</li>
			<li>Com a estrutura base para se montar os PLs, faz-se uso de processamento paralelo para resolver cada problema. Al&eacute;m do problema completo, com transmiss&atilde;o, tamb&eacute;m &eacute; criado um problema sem essa restri&ccedil;&atilde;o para eventual an&aacute;lise</li>
			<li>Os resultados s&atilde;o gravados nas tabelas <font face = "Courier New">BPO_A16_BALANCO</font>, <font face = "Courier New">BPO_A17_BALANCO_GERADOR</font> e <font face = "Courier New">BPO_A20_BALANCO_SUBSISTEMA</font>. Na tabela <font face = "Courier New">BPO_A16_BALANCO</font> s&atilde;o gravados os balan&ccedil;os para cada m&ecirc;s, ano e s&eacute;rie h&iacute;drica de forma agregada por subsistema. A tabela <font face = "Courier New">BPO_A17_BALANCO_GERADOR</font> receber&aacute; as mesmas informa&ccedil;&otilde;es da tabela anterior, contudo, desagregada por gerador (essa tabela s&oacute; ser&aacute; gravada se o usu&aacute;rio selecionar essa necessidade na tela de navega&ccedil;&atilde;o da ferramenta). Por fim a tabela <font face = "Courier New">BPO_A20_BALANCO_SUBSISTEMA</font> apresenta a solu&ccedil;&atilde;o dual do problema, no caso, os CMOs</li>			
		</ol>
		<p>Ap&oacute;s o c&aacute;lculo dos diversos balan&ccedil;os de pot&ecirc;ncia, a ferramenta chega ao fim de sua execu&ccedil;&atilde;o.</p>
	</div>
</body>
</html>