<!DOCTYPE html>
<html lang="en" >
<head>
  <meta charset="UTF-8">
  <title>Como Utilizar a ferramenta?</title>

<link href='https://fonts.googleapis.com/css?family=Droid+Serif|Open+Sans:400,700' rel='stylesheet' type='text/css'>
<link rel="stylesheet" href="https://s3-us-west-2.amazonaws.com/s.cdpn.io/148866/reset.css"><link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/meyer-reset/2.0/reset.min.css">
<link rel="stylesheet" href="../css/informacao.css">
</head>
<!-- partial:index.partial.html -->
<body>
	<button class="button" onclick="location.href='index.html'" style="position: absolute; right: 0;">Voltar</button>
	<header>	
		<h1>Como Utilizar a ferramenta?</h1>
	</header>
	<br>
	<h2>Barra de navega&ccedil;&atilde;o</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/barra_navegacao.png" />
				</td>
				<td>
					Na barra de navega&ccedil;&atilde;o pode-se acessar a aba do c&aacute;lculo do balan&ccedil;o de pot&ecirc;ncia, a aba de gr&aacute;ficos, o link para ajuda e o bot&atilde;o de sair da ferramenta.
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2><font color="red">Aba Balan&ccedil;o de Pot&ecirc;ncia</font></h2>
	<br>
	<h2>Selecionar o tipo de caso</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/cb_tipo_caso.png" height = 70px />
				</td>
				<td>
					Nesta caixa de sele&ccedil;&atilde;o o usu&aacute;rio deve escolher a refer&ecirc;ncia de dados (caso) que vai ser usado para a execu&ccedil;&atilde;o da simula&ccedil;&atilde;o do balan&ccedil;o de de pot&ecirc;ncia.
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Selecionar o modelo</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/cb_modelo.png" height = 70px />
				</td>
				<td>
					Nesta caixa de sele&ccedil;&atilde;o, o usu&aacute;rio deve escolher o modelo utilizado para gerar os resultados de atendimento energ&eacute;tico (refer&ecirc;ncia de dados).
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Selecionar o tipo de demanda</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/cb_demanda.png" height = 70px />
				</td>
				<td>
					Nesta caixa de sele&ccedil;&atilde;o, o usu&aacute;rio deve escolher o tipo de demanda que ser&aacute; usada no c&aacute;lculo do balan&ccedil;o de pot&ecirc;ncia. As op&ccedil;&otilde;es s&atilde;o: (i) Determin&iacute;stica, com a demanda sendo simulada no balan&ccedil;o como um &lsquo;&uacute;nico valor a cada m&ecirc;s do horizonte de simula&ccedil;&atilde;o, e (ii) L&iacute;quida, onde, o balan&ccedil;o ser&aacute; calculado para uma distribui&ccedil;&atilde;o de valores de demanda l&iacute;quida que &eacute; formada pela demanda bruta menos as gera&ccedil;&otilde;es das fontes n&atilde;o control&aacute;veis.	
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Definir o n&uacute;mero do caso</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/tb_caso.png" height = 70px />
				</td>
				<td>
					Nesta caixa de texto, o usu&aacute;rio deve atribuir um n&uacute;mero de caso para identificar o seu estudo de balan&ccedil;o de pot&ecirc;ncia.	
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Definir o n&uacute;mero de horas de ponta</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/tb_horas_ponta.png" height = 70px />
				</td>
				<td>
					Nesta caixa de texto, o usu&aacute;rio deve definir o n&uacute;mero de horas de demanda m&aacute;xima (ponta) que devem ser atendidas no c&aacute;lculo do balan&ccedil;o, a cada m&ecirc;s do horizonte de simula&ccedil;&atilde;o. Na simula&ccedil;&atilde;o realizada no contexto do PDE, a dura&ccedil;&atilde;o do patamar que representa a demanda m&aacute;xima de pot&ecirc;ncia &eacute; de 10 horas/m&ecirc;s.
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Descri&ccedil;&atilde;o do caso</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/tb_descricao.png" />
				</td>
				<td>
					Nesta caixa de texto, o usu&aacute;rio pode incluir uma descri&ccedil;&atilde;o sucinta do caso em estudo.
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Definir as datas de in&iacute;cio e fim do estudo do MDI</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/tb_data_MDI.png" />
				</td>
				<td>
					Nestas duas caixas de texto o usu&aacute;rio deve definir as datas de in&iacute;cio e fim do estudo do MDI. O formato deve ser aaaamm. Por exemplo 201901 e 203312.
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Definir os reservat&oacute;rios equivalentes que n&atilde;o modulam e usam dados de gera&ccedil;&atilde;o m&eacute;dia mensal</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/tbs_ree_nao_modulam_media.png" height = 70px />
				</td>
				<td>
					Nesta caixa de texto,o usu&aacute;rio deve definir somente os c&oacute;digos dos REEs (Reservat&oacute;rios Equivalentes de Energia), existentes no arquivo ree.dat do NEWAVE, que ter&atilde;o como disponibilidade de pot&ecirc;ncia a gera&ccedil;&atilde;o hidr&aacute;ulica m&eacute;dia mensal, para cada uma das series hidrol&oacute;gicas simuladas. Esses c&oacute;digos devem ser informados separados por v&iacute;rgulas. Exemplo: 6, 8, 13
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Definir os reservat&oacute;rios equivalentes que n&atilde;o modulam e usam dados do patamar de ponta</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/tbs_ree_nao_modulam_ponta.png" height = 70px />
				</td>
				<td>
					Nesta caixa de texto, o usu&aacute;rio deve definir somente os c&oacute;digos dos REEs, existentes no arquivo ree.dat do NEWAVE, que ter&atilde;o como disponibilidade de pot&ecirc;ncia a gera&ccedil;&atilde;o hidr&aacute;ulica do patamar de ponta, para cada uma das series hidrol&oacute;gicas simuladas. Esses c&oacute;digos devem ser informados separados por v&iacute;rgulas. Exemplo: 6, 8, 13
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Definir base SQLite existente para gravar o balan&ccedil;o de pot&ecirc;ncia</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/btn_pesquisar_base.png" height = 70px />
				</td>
				<td>
					Ao pressionar o bot&atilde;o indicado, o usu&aacute;rio poder&aacute; selecionar a base SQLite onde ser&atilde;o gravadas as informa&ccedil;&otilde;es da simula&ccedil;&atilde;o do balan&ccedil;o de pot&ecirc;ncia. Caso n&atilde;o exista uma base, ela pode ser criada pelo procedimento abaixo.
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Criar base SQLite para gravar o balan&ccedil;o de pot&ecirc;ncia</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/btn_criar_base.png" height = 70px />
				</td>
				<td>
					Ao pressionar o bot&atilde;o indicado, a janela mostrada abaixo ser&aacute; aberta para o usu&aacute;rio, onde ser&atilde;o solicitadas a escolha do local e a identifica&ccedil;&atilde;o da base SQLite onde ser&atilde;o gravadas as informa&ccedil;&otilde;es do balan&ccedil;o de pot&ecirc;ncia.<br>
					<img src = "../imagens/janela_nova_base.png" height = 200px />
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Selecionar a localiza&ccedil;&atilde;o dos arquivos com dados do caso para o balan&ccedil;o de pot&ecirc;ncia</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/btn_pasta_caso.png" height = 65px />
				</td>
				<td>
					Ao pressionar o bot&atilde;o indicado, o usu&aacute;rio poder&aacute; selecionar a pasta onde est&atilde;o os arquivos do caso (deck) que ser&atilde;o usados para o c&aacute;culo do balan&ccedil;o de pot&ecirc;ncia.
					Nota: Em caso de rodada com o modelo NEWAVE com deck de PDE, tamb&eacute;m deve constar nessa pasta os seguintes arquivos: (i) Saidaexpansao.txt (arquivo de sa&iacute;da do Modelo MDI), que cont&eacute;m o detalhamento por fonte da expans&atilde;o indicativa das usinas n&atilde;o simuladas pelo NEWAVE; (ii) Planilha GeraPeq contendo os dados de usinas n&atilde;o simuladas existentes para o PMO utilizado como refer&ecirc;ncia no deck do PDE; (iii) Arquivo de sa&iacute;da relat, referente ao deck do PDE, e (iv) Planilha dadosOFR contendo as contribui&ccedil;&otilde;es de pot&ecirc;ncia das usinas n&atilde;o simuladas.
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Selecionar a localiza&ccedil;&atilde;o dos arquivos com dados de sa&iacute;das do caso (nwlistop) para o balan&ccedil;o de ponta</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/btn_pasta_caso_saidas.png" height = 65px />
				</td>
				<td>
					Ao pressionar o botão indicado, o usuário poderá selecionar a pasta onde estão os arquivos nwlistop de saída do caso com todos os REEs do deck. Os arquivos necessários são: geração hidráulica (ghtot), energia armazenada final (%) em relação à máxima (earmfp) e vertimento turbinável fio d’água (vertturb).
					Nota: O número de séries destes arquivos de saída deve ser compatível com o tipo de simulação informado no arquivo dger, contido no deck de entrada.
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Calcular o balan&ccedil;o de ponta</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/btn_calcula_balanco.png" height = 65px />
				</td>
				<td>
					Ao pressionar o bot&atilde;o indicado, o usu&aacute;rio ir&aacute; executar o c&aacute;lculo do balan&ccedil;o de ponta. Caso a caixa de sele&ccedil;&atilde;o esteja marcada, ser&atilde;o gravadas somente as informa&ccedil;&otilde;es por REE. Se estiver desmarcada, as informa&ccedil;&otilde;es de despacho detalhado por usina tamb&eacute;m ser&atilde;o gravadas e o tempo de processamento ser&aacute; maior, assim como o tamanho da base de dados. Por padr&atilde;o, consta marcada a op&ccedil;&atilde;o &ldquo;Balan&ccedil;o resumido&rdquo;.
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2><font color="red">Aba Gr&aacute;ficos</font></h2>
	<br>
	<h2>Definir base SQLite existente para exibir gr&aacute;ficos do balan&ccedil;o de pot&ecirc;ncia</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/btn_pesquisar_base_grafico.png" height = 70px />
				</td>
				<td>
					Ao pressionar o bot&atilde;o indicado, o usu&aacute;rio poder&aacute; selecionar uma base SQLite com informa&ccedil;&otilde;es da simula&ccedil;&atilde;o de balan&ccedil;os de pot&ecirc;ncia para, posteriormente, exibir alguns indicadores de forma gr&aacute;fica.
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Selecionar caso de balan&ccedil;o de pot&ecirc;ncia</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/cb_caso_grafico.png" height = 70px />
				</td>
				<td>
					Nesta caixa de sele&ccedil;&atilde;o o usu&aacute;rio deve escolher um dos casos dispon&iacute;veis na base SQLite para exibi&ccedil;&atilde;o gr&aacute;fica. 
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Definir datas do eixo x do gr&aacute;fico</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/tb_data_grafico.png" height = 70px />
				</td>
				<td>
					Nestas duas caixas de texto o usu&aacute;rio deve definir os anos de in&iacute;cio e fim que ser&atilde;o exibidos nos gr&aacute;ficos. O formato deve ser aaaa. Por exemplo 2020.
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Definir tipo de gr&aacute;fico</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/cb_tipo_grafico.png" height = 65px />
				</td>
				<td>
					Nesta caixa de sele&ccedil;&atilde;o o usu&aacute;rio deve informar o tipo de gr&aacute;fico de avalia&ccedil;&atilde;o dos crit&eacute;rios de suprimento: CVaR Mensal ou LOLP anual.
				</td>
			</tr>
		</table>
	</div>
	<br>
	<h2>Exibir e baixar gr&aacute;fico</h2>
	<div class="boxed">
		<table>
			<tr>
				<td width = 370px>
					<img src = "../imagens/btn_exibe_download_grafico.png" height = 45px />
				</td>
				<td>
					O primeiro bot&atilde;o exibe o gr&aacute;fico selecionado e o segundo efetua o download dos dados do gr&aacute;fico para planilha em formato Excel.
				</td>
			</tr>
		</table>
	</div>
</body>
</html>